In [9]:
import sqlite3
import pandas as pd
import numpy as np

In [10]:
connection = sqlite3.connect('data.sqlite')

In [18]:
data_base = pd.DataFrame(np.random.randint(0,100,size=(100000, 5)), columns=list('UVXYZ'))
data_base

        U   V   X   Y   Z
0      47  56  73  76  68
1      40  49  40  91  40
2      95  61  49  87  96
3       2  79  71  82  15
4      60  43  83  31  82
...    ..  ..  ..  ..  ..
99995  31  71  70  54  93
99996  53  55  35  76  83
99997  86  52  27  97  10
99998  48   2  51  82  90
99999  79  52  77  85  99

[100000 rows x 5 columns]

In [ ]:
connection = sqlite3.connect('/Users/trymore/data.sqlite')
df.to_sql('abcde', connection, if_exists='replace', index=False)
pd.read_sql('select * from abcde', connection)

In [22]:
max_1 = data_base.max(axis=1)
print (max_1)

0        76
1        91
2        96
3        82
4        83
         ..
99995    93
99996    83
99997    97
99998    90
99999    99
Length: 100000, dtype: int32

In [25]:
(data_base.values == 50).sum()

5059

In [26]:
sum_1= data_base.sum(axis=1)
print (sum_1)

0        320
1        260
2        388
3        249
4        299
        ...
99995    319
99996    302
99997    272
99998    273
99999    392
Length: 100000, dtype: int64